Homework/HW3/HW3_Sp15.tex
% Created 2015-03-19 Thu 18:22
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage{minted}
\usepackage{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
\usepackage{fancyhdr}
\usepackage{hyperref}
\usepackage{setspace}
\usepackage[labelfont=bf]{caption}
\usepackage{amsmath}
\usepackage{enumerate}
\usepackage[parfill]{parskip}
\date{Due: 02/12/2015}
\title{}
\begin{document}

\title{Homework 3\\Lectures 4: Electronic Structure Models\\(CBE 60547)}
\author{Prof. William F.\ Schneider}
\maketitle


Here is an example input deck for a HFS/6-31G calculation on NH$_{\text{3}}$. This is a good starting template for the calculations below. You can also construct an input deck in Avogadro. Refer to the GAMESS manual for more information.

\begin{verbatim}
!   File created by the GAMESS Input Deck Generator Plugin for Avogadro
 $BASIS GBASIS=N31 NGAUSS=6 $END
 $CONTRL RUNTYP=ENERGY DFTTYP=SLATER $END

 $DATA 
Title
C1
N     7.0    -1.03363     0.80618     0.00000
H     1.0    -0.01363     0.80618     0.00000
H     1.0    -1.37362     1.64340    -0.47314
H     1.0    -1.37363     0.79732     0.96162
 $END
\end{verbatim}


\section{\texttt{GAMESS} vs. \texttt{FDA}}
\label{sec-1}

Using \texttt{GAMESS}, perform a DFT/Hartree-Fock-Slater (\verb~DFTTYP=SLATER~) calculation on an Ar atom using the 6-31G basis set.

\begin{enumerate}[(a)]
\item How many primitive Gaussians are included in this calculation? How many total basis functions? How do they divide between s, p, and d?

\item How many SCF iterations does the calculation take to converge?

\item What is the final calculated HFS/6-31G energy of the atom?

\item What are the identities (1s, 2p, etc.) and energies of the occupied atomic orbitals?

\item Compare your computed total energy and atomic orbital energies with those you got from Homework 2 using the fda code for Ar.
\end{enumerate}

\section{The Generalized Gradient Approximation}
\label{sec-2}

The generalized gradient approximation (GGA) is an improvement on Hartree-Fock-Slater that gives a nice balance between accuracy and computational expense. Using \texttt{GAMESS}, perform a single point calculation (\verb~RUNTYP=ENERGY~) on the bent triatomic SO$_{\text{2}}$ using the GGA (\verb~DFTTYP=PBE~) and PC1 basis set (\verb~GBASIS=PC1~, \verb~ISPHER=1~; no \verb~NGAUSS~ flag needed). Guess appropriate bond lengths and angle. Be sure to report your input file for your calculation.

\begin{enumerate}[(a)]
\item What is the spin multiplicity of SO$_{\text{2}}$? (Recall, the spin multiplicity is 2S +1, where S = 1/2 for one unpaired electron, S = 1 for two unpaired electrons, and so on).

\item How many basis functions are in this calculation?

\item How many SCF cycles does it take to converge?

\item What SCF algorithm does the code use?

\item What is the final total energy of the molecule?

\item How many occupied orbitals does the molecule have? What are the energies of the HOMO and LUMO?

\item What is the final dipole moment?

\item What are the Mulliken gross charges on the S and O atoms?

\item Plot out the electrostatic potential of SO$_{\text{2}}$. Which end of the molecule is electrophilic and which is nucleophilic?
\end{enumerate}

\section{Geometry Optimization of SO$_{\text{2}}$}
\label{sec-3}

\begin{enumerate}[(a)]
\item Do a series of calculations in which you vary the S–O distances and O–S–O angle over a regular grid of values. Approximate the combination of values that give the lowest energy.

\item A geometry optimization (\verb~RUNTYP=OPTIMIZE~) is a faster way to find the optimal geometry of a molecule. Perform a geometry optimization on SO$_{\text{2}}$ using the same computational model as above. What are the optimal S–O distances and O–S–O angle?
\end{enumerate}

\section{Other Molecules}
\label{sec-4}

Oxygen makes bonds with lots of things. Fill out the table below by doing an appropriate set of calculations:

\begin{center}
\begin{tabular}{llllll}
AO$_{\text{2}}$ & A-O (\AA{}) & O-A-O (\textdegree{}) & Spin Multiplicity & Dipole Moment (e\AA{}) & Mulliken Charge\\
\hline
CO$_{\text{2}}$ &  &  &  &  & \\
NO$_{\text{2}}$ &  &  &  &  & \\
SiO$_{\text{2}}$ &  &  &  &  & \\
SO$_{\text{2}}$ &  &  &  &  & \\
\end{tabular}
\end{center}
% Emacs 24.4.3 (Org mode 8.2.10)
\end{document}